--- a/README.md
+++ b/README.md
@@ -56,22 +56,14 @@ MardownEditor:**Personnalmage**
 Schema de l'architecture du stack:
-<div hidden>
-	
 ```mermaid
-@startuml firstDiagram 
-
-A[Utilisateur] -- Host_url + Port --> B((Host_URL:PORT))
-B --> E((Markdown))
-B --> C(MediaWiki)
-B --> G{Owncloud}
-B --> P{PHPMyAdmin}
-G --> D
-P --> D
-C --> D((Mariadb))
-A -- docker exec -it bash  --> D
+graph TD;
+    A(utilisateur)-->B(HOST_IP + PORT);
+    B-->C(Owncloud)-->X(mariadb);
+    B-->D(MediaWiki)-->X;
+    B-->E(MarkDownEditor);
+    B-->F(phpMyAdmin)-->X;
 ```
-</div>
 
 ## TODO
